tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Command-line tool for DigitalOcean
brew "doctl"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Command-line tool to interact with exercism.io
brew "exercism"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Network logon cracker which supports many services
brew "hydra"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql", restart_service: true
# Show ps output as a tree
brew "pstree"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Erlang build tool
brew "rebar3"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
cask "alacritty"
